public class CardText
{
    public static readonly string[] cardAbilityText = {
        "无",
        "间谍: 加入对面吹奏部，让己方新增两名部员。",
        "投掷: 投掷号嘴（或洗手液等），使指定对方一名部员吹奏能力降低。",
        "调音: 消除己方除天气外的所有不良影响。",
        "同袍之情: 当CP（或组合）同时登场时，吹奏能力翻倍。",
        "伞击: 令对方实力最强的木管成员退部（仅当对方木管总吹奏实力大于10）。",
        "抱团: 令牌组中自己的闺蜜/基友立即上场比赛。",
        "士气: 高喊“北宇治Fight！”，使同一行内除自己以外的部员吹奏能力+1。",
        "复活: 令一名退部/毕业的部员（天王除外）回归吹奏部，并立即加入演奏。",
        "支援: 使同一行内除自己之外的部员吹奏实力翻倍。",
        "大号君: 换下场上一名部员，使其可以继续参加后面的比赛。",
        "退部申请书: 令场上双方部员中实力最强的部员（非英雄牌）直接退部。",
        "日升祭：参加SunFes，令双方所有木管乐器吹奏能力降为1。",
        "第三乐章：演奏《利兹与青鸟》第三乐章，令双方所有铜管乐器吹奏能力降为1。",
        "忘带鼓槌：令双方所有打击乐器吹奏能力降为1。",
        "清除天气：消除所有天气影响。",
        "指导老师: 使同一行内所有部员吹奏实力翻倍。",
        "铜管指导：使铜管乐器部员吹奏实力翻倍。"
    };

    public static readonly string[] cardGroupText = {
        "久一年S1",
        "久一年S2",
        "久二年"
    };

    // 牌组能力
    public static readonly string[] cardGroupAbilityText = {
        "每赢得一轮可以再抽一张牌（此牌组还未制作）",
        "每轮结束后随机一名部员留在场上（此牌组还未制作）",
        "比分相同时算本方胜利"
    };
}
