public class CardText
{
    public static readonly string[] cardAbilityText = {
        "无",
        "间谍： 加入对面吹奏部，让己方新增两名部员。",
        "投掷： 投掷号嘴（或洗手液等），使指定对方一名部员吹奏能力降低。",
        "调音： 消除己方除天气外的所有不良影响。",
        "同袍之情： 当CP（或组合）同时登场时，吹奏能力翻倍。",
        "伞击： 令对方实力最强的木管成员退部（仅当对方木管总吹奏实力大于10）。",
        "抱团： 令牌组中自己的闺蜜/基友立即上场比赛。",
        "士气： 高喊“北宇治Fight！”，使同一行内除自己以外的部员吹奏能力+1。",
        "复活： 令一名退部/毕业的部员（天王除外）回归吹奏部，并立即加入演奏。",
        "支援： 使同一行内除自己之外的部员吹奏实力翻倍。",
        "大号君： 换下场上一名部员，使其可以继续参加后面的比赛。",
        "退部申请书： 令场上双方部员中实力最强的部员（非英雄牌）直接退部。",
        "日升祭：参加SunFes，令双方所有木管乐器吹奏能力降为1。",
        "第三乐章：演奏《利兹与青鸟》第三乐章，令双方所有铜管乐器吹奏能力降为1。",
        "忘带鼓槌：令双方所有打击乐器吹奏能力降为1。",
        "清除天气：消除所有天气影响。",
        "指导老师： 使同一行内所有部员吹奏实力翻倍。",
        "铜管指导：使铜管乐器部员吹奏实力翻倍。",
        "迷唇： 使对方所有男性部员吹奏能力降低2。",
        "卫队： 守卫的目标部员在（任意一方）场上时，使指定对方一名部员吹奏能力降低4。",
        "Monaka： 给己方一名场上部员赠送护身符，使其吹奏能力+2。",
        "伞： 消除本方铠冢霙除天气外的不良影响，并使其吹奏能力+5。",
        "新人领袖： 使本方场上除自己之外所有的一年级部员吹奏能力+2",
        "爱的礼赞：打出时若本方川岛绿辉在场，则自己吹奏能力+3",
        "高压：使本方场上所有部员的吹奏能力，50%概率+2，50%概率-1",
        "防守：自身所在行的部员，本小局结束前不会被移除",
        "实力至上：对方场上所有点数小于4的部员，吹奏能力降低1",
    };

    public static readonly string[] cardGroupText = {
        "久一年",
        "久二年",
        "久三年"
    };

    // 牌组能力
    public static readonly string[] cardGroupAbilityText = {
        "小局结算时分数比对方高，可以抽一张手牌",
        "小局结算时，比分相同算本方胜利",
        "每小局结束后，随机一名部员清除所有buff并留在场上"
    };
}
